/*
// 32-х разрядное целое число со знаком
int number = 7;

// 64-х разрядное число со знаком(поддерживает дроби)
double number2 = 1.5;
decimal number3 = 3.4m;  // используется если надо получить дробное значение от работы с int
int fahrenheit = 94;
decimal celsius = (fahrenheit - 32m) * (5m / 9m);

// строка( много символов, числа воспринимаются как символы, занаки препинания и пробелы тоже, аккуратнее с регистрами)
char str = 'у';
string stroka = "любое слово";

// Булевое значение, имеет только True или False( на машинном 1 или 0)
bool check = true;

// массив элементов. Может быть численным и символьным
int[] array = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
string[] array1 = {" a, b, c, d, e, f, g, h, !, слово, 4563 "};

//  Операторы
//  + сложение
int number = 1 + 7;
//  - вычитание 
int number = 12 - number;
//  * умножение
int number = number * 2;
//  / деление 
int number = number / (number / 2);
//  % остаток от деления
int number = number % 3;
//  ++ прибаление 1 к значению
number++;
//  -- вычитание 1 от значения
number--;
//  += прибаление к значению заданного числа
number += 5;
//  -= вычитание из значения заданного числа
number -= 5;
//  *= умножить значение на заданное число
number *= 5;
// /= деление значения на заданное число
number /=5;

*/